// See https://aka.ms/new-console-template for more information

/*Напишите программу, которая на вхоl
 принимает число и выдаёт его квадрат (число умноженное на само себя).
*/
/*
Console.WriteLine("Введите число: ");
// Считываем данные консоли
string? inputNum = Console.ReadLine()??"0";
// Проверяем чтобы данные были не пустыми
if(inputNum!=nu11)
// Парсим введенное число
{

    int num = int.Parse(inputNum);

    int res = num*num;

    Console.WriteLine(res);

}
*/


Console.WriteLine("Квадрат числа: "+(int)Math.Pow(int.Parse(InputNum),2));