// Напишите программу, которая на вход принимает
//  число и выдаёт, является ли число чётным (делится ли оно на два без остатка)


int numA = int.Parse(Console.ReadLine()??"0");
int res = numA/2;

if(res = 0){

Console.WriteLine(" ");
}
else 
Console.WriteLine(" ");
